# 1. Business Understanding

## 1.1 Introduction

Microsoft movie project seeks to ssek out relevant data which will be used by Microsoft in building a movie studio. The project focuses on Box Office Mojo, movie budgets and other movie information that has been used by other movie production companies.
After understanding the data, data will be cleaned to:removing any duplicates, Checking any missing data,Removing any irrelevant data. 
Thereafter Visualizations to present the data will be made to ensure it is easy to understand to the leader of microsoft.

## 1.2 Problem Statement

Microsoft wants to get into the movie industry. However they don't know much about the industry. They therefore want a data scientist to evaluate the movie industry, to identify which movies are actually doing well at the box office hence providing them with actionable insights that the company, Microsoft, can use to determine the films they will major on.

## 1.3 Main Objective

This project aims to help Microsoft's new movie studio make informed decisions about the types of films to create. By analyzing data from the film industry, insights and trends that will assist in identifying successful strategies for the studio can be uncovered.

## 1.4 Specific Objectives

a). Identify the most successful movie genres that microsoft head will use to make a prompt decision on which type of movies to put more focus on.

b). To visualize movie budgets (especially using the tn movie budgets file)

c). Understanding how different branches of the entire movie field affect the company reputation and sequentials for thaat matter. E.g., rating, genre, runtime.

## 1.5 Notebook Structure

Introduction

`Problem Statement

Main Objective

Specific Ojectives

Importing Libraries

Data Understanding

Data Cleaning

Data Visualizations

Conclusions

Recommendations

# 2. Importing Libraries

In [74]:
import csv
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

# 3. Data Understanding

## 3.1 Box office mojo

In [34]:
# Loading the data
bom_data = pd.read_csv("Data/bom.movie_gross.csv")

In [35]:
# viewing the columns
bom_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [36]:
#To see the first rows in order to get a visual of how the data looks like
bom_data.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [37]:
#To see the last rows in order to get a visual of how the data looks like
bom_data.tail()

,title,studio,domestic_gross,foreign_gross,year
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

In [38]:
# To get a glimpse of the data measures
bom_data.describe()

       domestic_gross         year
count    3.359000e+03  3387.000000
mean     2.874585e+07  2013.958075
std      6.698250e+07     2.478141
min      1.000000e+02  2010.000000
25%      1.200000e+05  2012.000000
50%      1.400000e+06  2014.000000
75%      2.790000e+07  2016.000000
max      9.367000e+08  2018.000000

## 3.2 tn.movie_budgets.csv

In [39]:
# Loading the data
tn_movie_budgets = pd.read_csv("Data/tn.movie_budgets.csv")

In [40]:
# viewing the columns
tn_movie_budgets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [41]:
#To see the first rows in order to get a visual of how the data looks like
tn_movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [42]:
#To see the last rows in order to get a visual of how the data looks like
tn_movie_budgets.tail()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [43]:
# To get a glimpse of the data measures
tn_movie_budgets.describe()

                id
count  5782.000000
mean     50.372363
std      28.821076
min       1.000000
25%      25.000000
50%      50.000000
75%      75.000000
max     100.000000

## 3.3 rt.movie.info.tsv

In [44]:
# Loading the data
rt_movie_info = pd.read_csv("Data/rt.movie_info.tsv", delimiter = "\t")

In [45]:
# viewing the columns
rt_movie_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1560 entries, 0 to 1559
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            1560 non-null   int64
 1   synopsis      1498 non-null   object
 2   rating        1557 non-null   object
 3   genre         1552 non-null   object
 4   director      1361 non-null   object
 5   writer        1111 non-null   object
 6   theater_date  1201 non-null   object
 7   dvd_date      1201 non-null   object
 8   currency      340 non-null    object
 9   box_office    340 non-null    object
 10  runtime       1530 non-null   object
 11  studio        494 non-null    object
dtypes: int64(1), object(11)
memory usage: 146.4+ KB

In [46]:
#To see the first rows in order to get a visual of how the data looks like
rt_movie_info.head()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

In [47]:
#To see the last rows in order to get a visual of how the data looks like
rt_movie_info.tail()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
1555,1996,Forget terrorists or hijackers -- there's a ha...,R,Action and Adventure|Horror|Mystery and Suspense,NaN,NaN,"Aug 18, 2006","Jan 2, 2007",$,"33,886,034",106 minutes,New Line Cinema
1556,1997,The popular Saturday Night Live sketch was exp...,PG,Comedy|Science Fiction and Fantasy,Steve Barron,Terry Turner|Tom Davis|Dan Aykroyd|Bonnie Turner,"Jul 23, 1993","Apr 17, 2001",NaN,NaN,88 minutes,Paramount Vantage
1557,1998,"Based on a novel by Richard Powell, when the l...",G,Classics|Comedy|Drama|Musical and Performing Arts,Gordon Douglas,NaN,"Jan 1, 1962","May 11, 2004",NaN,NaN,111 minutes,NaN
1558,1999,The Sandlot is a coming-of-age story about a g...,PG,Comedy|Drama|Kids and Family|Sports and Fitness,David Mickey Evans,David Mickey Evans|Robert Gunter,"Apr 1, 1993","Jan 29, 2002",NaN,NaN,101 minutes,NaN
1559,2000,"Suspended from the force, Paris cop Hubert is ...",R,Action and Adventure|Art House and Internation...,NaN,Luc Besson,"Sep 27, 2001","Feb 11, 2003",NaN,NaN,94 minutes,Columbia Pictures

In [48]:
# To get a glimpse of the data measures
rt_movie_info.describe()

                id
count  1560.000000
mean   1007.303846
std     579.164527
min       1.000000
25%     504.750000
50%    1007.500000
75%    1503.250000
max    2000.000000

# 4. Data Cleaning

## 4.1 bom.movies_gross.csv

### 4.1.1 Checking any missing data

In [49]:
print(bom_data.isna())
print(bom_data.isna().sum())
#True indicates NaN(Not a number)

      title  studio  domestic_gross  foreign_gross   year
0     False   False           False          False  False
1     False   False           False          False  False
2     False   False           False          False  False
3     False   False           False          False  False
4     False   False           False          False  False
...     ...     ...             ...            ...    ...
3382  False   False           False           True  False
3383  False   False           False           True  False
3384  False   False           False           True  False
3385  False   False           False           True  False
3386  False   False           False           True  False

[3387 rows x 5 columns]
title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

There are missing values in studio, foreign gross and domestic gross columns. To solve that, we replace the Null for Unknown the NaN value with the median

In [50]:
bom_data["studio"] = bom_data.studio.fillna("unknown")

Now we replace NaN with the median of the data

In [51]:
# Remove commas from "domestic_gross" column
bom_data["domestic_gross"] = bom_data.domestic_gross.fillna(0)

We will do the same for the foreign gross

In [52]:
# Remove commas from "foreign_gross" column
bom_data["foreign_gross"] = bom_data["foreign_gross"].replace(',', '')

# Convert "foreign_gross" column to float and fill missing values with 0
bom_data["foreign_gross"] = pd.to_numeric(bom_data["foreign_gross"], errors='coerce')
bom_data["foreign_gross"] = bom_data.domestic_gross.fillna(0)

In [53]:
#confirm there no more missing values
print(bom_data.isna().sum())

title             0
studio            0
domestic_gross    0
foreign_gross     0
year              0
dtype: int64

### 4.1.2 Removing any duplicates

In [54]:
bom_data[bom_data.duplicated(keep=False)].sort_values(by = "title")
# As per the output, there are no duplicated values

Empty DataFrame
Columns: [title, studio, domestic_gross, foreign_gross, year]
Index: []

### 4.1.3 Removing any irrelevant data

In [55]:
# check for any movie produced before 2010 or past 2018
bom_data[(bom_data["year"] < 2010) & (bom_data["year"] > 2018)]

Empty DataFrame
Columns: [title, studio, domestic_gross, foreign_gross, year]
Index: []

### 4.1.4 Arranging Messy columns

In [56]:
bom_data.columns
[col.strip() for col in bom_data.columns]
bom_data.columns.str.strip()

Index(['title', 'studio', 'domestic_gross', 'foreign_gross', 'year'], dtype='object')

## 4.2 tn_movie_budgets.csv

### 4.2.1 Checking any missing data

In [57]:
print(tn_movie_budgets.isna())
print(tn_movie_budgets.isna().sum())

         id  release_date  movie  production_budget  domestic_gross
0     False         False  False              False           False  \
1     False         False  False              False           False
2     False         False  False              False           False
3     False         False  False              False           False
4     False         False  False              False           False
...     ...           ...    ...                ...             ...
5777  False         False  False              False           False
5778  False         False  False              False           False
5779  False         False  False              False           False
5780  False         False  False              False           False
5781  False         False  False              False           False

      worldwide_gross
0               False
1               False
2               False
3               False
4               False
...               ...
5777            False
5778            False
5779            False
5780            False
5781            False

[5782 rows x 6 columns]
id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

In [84]:
#replacing missing values in director with unknown
tn_movie_budgets["release_date"] = tn_movie_budgets.release_date.fillna("released")

### 4.2.2 Removing any duplicates

First thing first, we check for any duplicated data in the id section. IDs should be unique to everyone

In [82]:
def identify_duplicates(data):
    """Simple function to identify any duplicates"""
    # identify the duplicates (dataframename.duplicated() , can add .sum() to get total count)
    # empty list to store Bool results from duplicated
    duplicates = []
    for i in data.duplicated():
        duplicates.append(i)
    # identify if there is any duplicates. (If there is any we expect a True value in the list duplicates)
    duplicates_set = set(duplicates) 
    if (len(duplicates_set) == 1):
        print("The Data has no duplicates")
    else:
        no_true = 0
        for val in duplicates:
            if (val == True):
                no_true += 1
        # percentage of the data represented by duplicates 
        duplicates_percentage = np.round(((no_true / len(data)) * 100), 3)
        print(f"The Data has {no_true} duplicated rows.\nThis constitutes {duplicates_percentage}% of the data set.") 


id = pd.DataFrame({'col1': [1, 2, 3, 3], 'col2': ['A', 'B', 'C', 'C']})
identify_duplicates(id)

The Data has 1 duplicated rows.
This constitutes 25.0% of the data set.

In [85]:
tn_movie_budgets

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,total_gross
0,1,released,Avatar,"$425,000,000",760507625.0,2.776345e+09,3.536853e+09
1,2,released,Pirates of the Caribbean: On Stranger Tides,"$410,600,000",241063875.0,1.045664e+09,1.286728e+09
2,3,released,Dark Phoenix,"$350,000,000",42762350.0,1.497624e+08,1.925247e+08
3,4,released,Avengers: Age of Ultron,"$330,600,000",459005868.0,1.403014e+09,1.862020e+09
4,5,released,Star Wars Ep. VIII: The Last Jedi,"$317,000,000",620181382.0,1.316722e+09,1.936903e+09
...,...,...,...,...,...,...,...
5777,78,released,Red 11,"$7,000",0.0,0.000000e+00,0.000000e+00
5778,79,released,Following,"$6,000",48482.0,2.404950e+05,2.889770e+05
5779,80,released,Return to the Land of Wonders,"$5,000",1338.0,1.338000e+03,2.676000e+03
5780,81,released,A Plague So Pleasant,"$1,400",0.0,0.000000e+00,0.000000e+00
5781,82,released,My Date With Drew,"$1,100",181041.0,1.810410e+05,3.620820e+05

### 4.2.3 Removing any irrelevant data

In [61]:
# # check for any movie produced before 2010 or past 2018
tn_movie_budgets["release_date"] = pd.to_numeric(tn_movie_budgets["release_date"], errors="coerce")
tn_movie_budgets[(tn_movie_budgets["release_date"] < 2010) & (tn_movie_budgets["release_date"] > 2018)]

Empty DataFrame
Columns: [id, release_date, movie, production_budget, domestic_gross, worldwide_gross]
Index: []

tn_movie_budgets has no irrelevant data

### 4.2.4 Arranging messy data

In [63]:
tn_movie_budgets.columns
[col.strip() for col in tn_movie_budgets.columns]
tn_movie_budgets.columns.str.strip()

Index(['id', 'release_date', 'movie', 'production_budget', 'domestic_gross',
       'worldwide_gross'],
      dtype='object')

### 4.2.5 Creating a new column to combine domestic and foreign gross

In [64]:
tn_movie_budgets['domestic_gross'] = tn_movie_budgets['domestic_gross'].str.replace('[\$,]', '', regex=True).astype(float)
tn_movie_budgets['worldwide_gross'] = tn_movie_budgets['worldwide_gross'].str.replace('[\$,]', '', regex=True).astype(float)

tn_movie_budgets["total_gross"] = tn_movie_budgets["domestic_gross"] + tn_movie_budgets["worldwide_gross"]
tn_movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,total_gross
0,1,NaN,Avatar,"$425,000,000",760507625.0,2.776345e+09,3.536853e+09
1,2,NaN,Pirates of the Caribbean: On Stranger Tides,"$410,600,000",241063875.0,1.045664e+09,1.286728e+09
2,3,NaN,Dark Phoenix,"$350,000,000",42762350.0,1.497624e+08,1.925247e+08
3,4,NaN,Avengers: Age of Ultron,"$330,600,000",459005868.0,1.403014e+09,1.862020e+09
4,5,NaN,Star Wars Ep. VIII: The Last Jedi,"$317,000,000",620181382.0,1.316722e+09,1.936903e+09

## 4.3 rt.reviews.tsv

### 4.3.1 Checking any missing data

In [88]:
rt_movie_info.isna()
rt_movie_info.isna().sum()

id              0
synopsis        0
rating          0
genre           0
director        0
writer          0
theater_date    0
dvd_date        0
currency        0
box_office      0
runtime         0
studio          0
dtype: int64

In [66]:
#replacing missing values in synopsis with unknown
rt_movie_info["synopsis"] = rt_movie_info.synopsis.fillna("unknown")

#replacing missing values in rating with R
rt_movie_info["rating"] = rt_movie_info.rating.fillna("R")

# replacing missing values in genre with the term Drama
rt_movie_info["genre"] = rt_movie_info.genre.fillna("Drama")

#replacing the missing values in director column with the data in writer column
rt_movie_info["director"] = rt_movie_info["director"].fillna(rt_movie_info["writer"])

#replacing the missing values in writer column with the data in the director column
rt_movie_info["writer"] = rt_movie_info["writer"].fillna(rt_movie_info["director"])

#replacing the missing values in theater date column with the data in the dvd date column
rt_movie_info["theater_date"] = rt_movie_info["theater_date"].fillna(rt_movie_info["dvd_date"])

#replacing the missing values in dvd date column with the data in the theater date column
rt_movie_info["dvd_date"] = rt_movie_info["dvd_date"].fillna(rt_movie_info["theater_date"])

# replacing currency($) with 0
rt_movie_info["currency"] = rt_movie_info.currency.fillna("0")

# replacing box office with the mean
rt_movie_info["box_office"] = rt_movie_info["box_office"].replace(",", "")
rt_movie_info["box_office"] = pd.to_numeric(rt_movie_info["box_office"], errors = "coerce")
rt_movie_info["box_office"] = rt_movie_info.box_office.fillna(0)

# replace missing values in runtime with 120 minutes
rt_movie_info["runtime"] = rt_movie_info.runtime.fillna("120 minutes")

#replace missing values in studio
rt_movie_info["studio"] = rt_movie_info.studio.fillna("Entertainment one")

Let's check if there any more missing values

In [67]:
print(rt_movie_info.isna().sum())

id                0
synopsis          0
rating            0
genre             0
director        131
writer          131
theater_date    359
dvd_date        359
currency          0
box_office        0
runtime           0
studio            0
dtype: int64

Since there are missing vlues, we have to continue cleaning

In [87]:
#replacing missing values in director with unknown
rt_movie_info["director"] = rt_movie_info.writer.fillna("unknown")

#replacing missing values in director with unknown
rt_movie_info["writer"] = rt_movie_info.writer.fillna("unknown")

#replacing missing values in director with unknown
rt_movie_info["theater_date"] = rt_movie_info.theater_date.fillna("released")

#replacing missing values in director with unknown
rt_movie_info["dvd_date"] = rt_movie_info.dvd_date.fillna("released")

#replacing missing values in box_office with median
rt_movie_info["box_office"].fillna(rt_movie_info.box_office.median())

0       0.0
1       0.0
2       0.0
3       0.0
4       0.0
       ...
1555    0.0
1556    0.0
1557    0.0
1558    0.0
1559    0.0
Name: box_office, Length: 1560, dtype: float64

In [69]:
# Take a look at the data once more
print(rt_movie_info.isna().sum())

id              0
synopsis        0
rating          0
genre           0
director        0
writer          0
theater_date    0
dvd_date        0
currency        0
box_office      0
runtime         0
studio          0
dtype: int64

All good to go! No missing data

### 4.3.2 Removing any duplicates

In [70]:
rt_movie_info[rt_movie_info.duplicated(keep=False)].sort_values(by = "id")
# As per the output, there are no duplicated values

Empty DataFrame
Columns: [id, synopsis, rating, genre, director, writer, theater_date, dvd_date, currency, box_office, runtime, studio]
Index: []

### 4.3.3 Removing irrelevant data

In [71]:
# # check for any movie produced before 2010 or past 2018
rt_movie_info["dvd_date"] = pd.to_numeric(rt_movie_info["dvd_date"], errors="coerce")
rt_movie_info[(rt_movie_info["dvd_date"] < 2010) & (rt_movie_info["dvd_date"] > 2018)]

Empty DataFrame
Columns: [id, synopsis, rating, genre, director, writer, theater_date, dvd_date, currency, box_office, runtime, studio]
Index: []

### 4.3.4 Arranging messy columns

In [72]:
rt_movie_info.columns
[col.strip() for col in rt_movie_info.columns]
rt_movie_info.columns.str.strip()

Index(['id', 'synopsis', 'rating', 'genre', 'director', 'writer',
       'theater_date', 'dvd_date', 'currency', 'box_office', 'runtime',
       'studio'],
      dtype='object')

# 5. Data Visualizations

# 6. Conclusions

## 7. Recommendations